app/controllers/patterns_controller.rb

  def index
    @patterns = Pattern.all
---
SELECT `patterns`.* FROM `patterns`